siredmar/master/gnublin/apex-1.6.8-vanilla-broken/src/mach-lpc313x/lpc313x.h
/* lpc313x.h

   written by Durgesh Pattamatta
   10 Oct 2008

   Copyright (C) 2008 NXP Semiconductors

   This program is free software; you can redistribute it and/or
   modify it under the terms of the GNU General Public License
   version 2 as published by the Free Software Foundation.
   Please refer to the file debian/copyright for further details.

   -----------
   DESCRIPTION
   -----------

*/

#if !defined (__LPC313X_H__)
#    define   __LPC313X_H__

/* ----- Includes */
#include <apex.h>

#include <asm/reg.h>

/* ----- Types */

/* ----- Globals */
#define _BIT(n)	  ((1) << (n))
/* shift bit field */
#define _SBF(f,v) ((v) << (f))

/* ----- Prototypes */

	/* Registers */
/***********************************************************************
 * WDT register definitions
 **********************************************************************/
#define WDT_PHYS      (0x13002400)
#define WDT_IR       __REG (WDT_PHYS + 0x00)
#define WDT_TCR      __REG (WDT_PHYS + 0x04)
#define WDT_TC       __REG (WDT_PHYS + 0x08)
#define WDT_PR       __REG (WDT_PHYS + 0x0c)
#define WDT_MCR      __REG (WDT_PHYS + 0x14)
#define WDT_MR0      __REG (WDT_PHYS + 0x18)
#define WDT_MR1      __REG (WDT_PHYS + 0x1c)
#define WDT_EMR      __REG (WDT_PHYS + 0x3c)

#define WDT_IR_MR1        _BIT(1)
#define WDT_IR_MR0        _BIT(0)
#define WDT_TCR_CNT_RESET _BIT(1)
#define WDT_TCR_CNT_EN    _BIT(0)
#define WDT_MCR_STOP_MR1  _BIT(5)
#define WDT_MCR_RESET_MR1 _BIT(4)
#define WDT_MCR_INT_MR1   _BIT(3)
#define WDT_MCR_STOP_MR0  _BIT(2)
#define WDT_MCR_RESET_MR0 _BIT(1)
#define WDT_MCR_INT_MR0   _BIT(0)
#define WDT_EMR_CTRL0(n)  _SBF(4,((n) &0x3))
#define WDT_EMR_CTRL1(n)  _SBF(6,((n) &0x3))
#define WDT_EMR_M1        _BIT(1)
#define WDT_EMR_M0        _BIT(0)

/***********************************************************************
 * Timer register definitions
 **********************************************************************/
#define TIMER0_PHYS     (0x13008000)
#define TIMER1_PHYS     (0x13008400)
#define TIMER2_PHYS     (0x13008800)
#define TIMER3_PHYS     (0x13008c00)
#define TIMER_LOAD      0x00
#define TIMER_VALUE     0x04
#define TIMER_CONTROL   0x08
#define TIMER_CLEAR     0x0c

#define TM_CTRL_ENABLE    _BIT(7)
#define TM_CTRL_MODE      _BIT(6)
#define TM_CTRL_PERIODIC  _BIT(6)
#define TM_CTRL_PS1       _SBF(2, 0)
#define TM_CTRL_PS16      _SBF(2, 1)
#define TM_CTRL_PS256     _SBF(2, 2)
#define TM_CTRL_PS_MASK   _SBF(2, 0x3)

/***********************************************************************
 * UART register definitions
 **********************************************************************/
#define UART_PHYS     (0x15001000)
#define UART_DLL      __REG (UART_PHYS + 0x00)
#define UART_FIFO     __REG (UART_PHYS + 0x00)
#define UART_IE       __REG (UART_PHYS + 0x04)
#define UART_DLM      __REG (UART_PHYS + 0x04)
#define UART_IIR      __REG (UART_PHYS + 0x08)
#define UART_FCR      __REG (UART_PHYS + 0x08)
#define UART_LCR      __REG (UART_PHYS + 0x0c)
#define UART_MCR      __REG (UART_PHYS + 0x10)
#define UART_LSR      __REG (UART_PHYS + 0x14)
#define UART_MSR      __REG (UART_PHYS + 0x18)
#define UART_SCR      __REG (UART_PHYS + 0x1c)
#define UART_ACR      __REG (UART_PHYS + 0x20)
#define UART_ICR      __REG (UART_PHYS + 0x24)
#define UART_FDR      __REG (UART_PHYS + 0x28)


#define UART_LOAD_DLL(div)          ((div) & 0xFF)
#define UART_LOAD_DLM(div)          (((div) >> 8) & 0xFF)
#define UART_LCR_DIVLATCH_EN       _BIT(7)
#define UART_LCR_WLEN_8BITS        _SBF(0, 3)
#define UART_FCR_DMA_MODE          _BIT(3)
#define UART_FCR_TXFIFO_FLUSH      _BIT(2)
#define UART_FCR_RXFIFO_FLUSH      _BIT(1)
#define UART_FCR_FIFO_EN           _BIT(0)
#define UART_LSR_FIFORX_ERR        _BIT(7)
#define UART_LSR_TEMT              _BIT(6)
#define UART_LSR_FR                _BIT(3)
#define UART_LSR_PE                _BIT(2)
#define UART_LSR_OE                _BIT(1)
#define UART_LSR_RDR               _BIT(0)

/***********************************************************************
 * SYS_REG register definitions
 **********************************************************************/
#define SYS_PHYS            (0x13002800)
#define SYS_SDMMC_DELAYMODES   __REG (SYS_PHYS + 0x2C)
#define SYS_USB_ATX_PLL_PD_REG __REG (SYS_PHYS + 0x30)
#define SYS_USB_OTG_CFG        __REG (SYS_PHYS + 0x34)
#define SYS_USB_OTG_LED_CTL    __REG (SYS_PHYS + 0x38)
#define SYS_USB_PLL_NDEC       __REG (SYS_PHYS + 0x40)
#define SYS_USB_PLL_MDEC       __REG (SYS_PHYS + 0x44)
#define SYS_USB_PLL_PDEC       __REG (SYS_PHYS + 0x48)
#define SYS_USB_PLL_SELR       __REG (SYS_PHYS + 0x4C)
#define SYS_USB_PLL_SELI       __REG (SYS_PHYS + 0x50)
#define SYS_USB_PLL_SELP       __REG (SYS_PHYS + 0x54)

#define SYS_MPMC_DELAY      __REG (SYS_PHYS + 0x68)
#define SYS_MPMC_WTD_DEL0   __REG (SYS_PHYS + 0x6C)
#define SYS_MPMC_WTD_DEL1   __REG (SYS_PHYS + 0x70)
#define SYS_MPMC_TESTMODE0  __REG (SYS_PHYS + 0x78)
#define SYS_MPMC_TESTMODE1  __REG (SYS_PHYS + 0x7C)
#define SYS_REMAP_ADDR      __REG (SYS_PHYS + 0x84)
#define SYS_MUX_LCD_EBI     __REG (SYS_PHYS + 0x90)
#define SYS_MUX_GPIO_MCI    __REG (SYS_PHYS + 0x94)
#define SYS_MUX_NAND_MCI    __REG (SYS_PHYS + 0x98)

/***********************************************************************
 * GPIO register definitions
 **********************************************************************/
#define GPIO_PHYS            (0x13003000)
#define GPIO_STATE(port)     __REG (GPIO_PHYS + (port) + 0x00)
#define GPIO_M0_SET(port)    __REG (GPIO_PHYS + (port) + 0x14)
#define GPIO_M0_RESET(port)  __REG (GPIO_PHYS + (port) + 0x18)
#define GPIO_M1_SET(port)    __REG (GPIO_PHYS + (port) + 0x24)
#define GPIO_M1_RESET(port)  __REG (GPIO_PHYS + (port) + 0x28)

#define GPIO_OUT_LOW(port, pin)  do { GPIO_M1_SET(port) = pin; GPIO_M0_RESET(port) = pin;} while(0)
#define GPIO_OUT_HIGH(port, pin) do { GPIO_M1_SET(port) = pin; GPIO_M0_SET(port) = pin;} while(0)
#define GPIO_IN(port, pin)       do { GPIO_M1_RESET(port) = pin; GPIO_M0_RESET(port) = pin;} while(0)
#define GPIO_DRV_IP(port, pin)   do { GPIO_M1_RESET(port) = pin; GPIO_M0_SET(port) = pin;} while(0)

#define IOCONF_EBI_MCI       (0x000)
#define IOCONF_EBI_I2STX_0   (0x040)
#define IOCONF_CGU           (0x080)
#define IOCONF_I2SRX_0       (0x0c0)
#define IOCONF_I2SRX_1       (0x100)
#define IOCONF_I2STX_1       (0x140)
#define IOCONF_EBI           (0x180)
#define IOCONF_GPIO          (0x1c0)
#define IOCONF_I2C1          (0x200)
#define IOCONF_SPI           (0x240)
#define IOCONF_NAND_CTRL     (0x280)
#define IOCONF_PWM           (0x2c0)
#define IOCONF_UART          (0x300)

/***********************************************************************
 * Event router register definitions
 **********************************************************************/
#define EVTR_PHYS            (0x13000000)
#define EVRT_INT_PEND(bank)  __REG (EVTR_PHYS + 0xC00 + ((bank) << 2))
#define EVRT_INT_CLR(bank)   __REG (EVTR_PHYS + 0xC20 + ((bank) << 2))
#define EVRT_INT_SET(bank)   __REG (EVTR_PHYS + 0xC40 + ((bank) << 2))
#define EVRT_MASK(bank)      __REG (EVTR_PHYS + 0xC60 + ((bank) << 2))
#define EVRT_MASK_CLR(bank)  __REG (EVTR_PHYS + 0xC80 + ((bank) << 2))
#define EVRT_MASK_SET(bank)  __REG (EVTR_PHYS + 0xCA0 + ((bank) << 2))
#define EVRT_APR(bank)       __REG (EVTR_PHYS + 0xCC0 + ((bank) << 2))
#define EVRT_ATR(bank)       __REG (EVTR_PHYS + 0xCE0 + ((bank) << 2))
#define EVRT_RSR(bank)       __REG (EVTR_PHYS + 0xD20 + ((bank) << 2))
#define EVRT_OUT_PEND(vec,bank)     __REG (EVTR_PHYS + 0x1000 + ((vec) << 5) + ((bank) << 2))
#define EVRT_OUT_MASK(vec,bank)     __REG (EVTR_PHYS + 0x1400 + ((vec) << 5) + ((bank) << 2))
#define EVRT_OUT_MASK_CLR(vec,bank) __REG (EVTR_PHYS + 0x1800 + ((vec) << 5) + ((bank) << 2))
#define EVRT_OUT_MASK_SET(vec,bank) __REG (EVTR_PHYS + 0x1C00 + ((vec) << 5) + ((bank) << 2))

/***********************************************************************
 * MPMC memory controller register definitions
 **********************************************************************/
#define MPMC_PHYS           (0x17008000)
#define MPMC_CTRL           __REG (MPMC_PHYS + 0x000)
#define MPMC_STATUS         __REG (MPMC_PHYS + 0x004)
#define MPMC_CONFIG         __REG (MPMC_PHYS + 0x008)
#define MPMC_DYNCTL         __REG (MPMC_PHYS + 0x020)
#define MPMC_DYNREF         __REG (MPMC_PHYS + 0x024)
#define MPMC_DYRDCFG        __REG (MPMC_PHYS + 0x028)
#define MPMC_DYTRP          __REG (MPMC_PHYS + 0x030)
#define MPMC_DYTRAS         __REG (MPMC_PHYS + 0x034)
#define MPMC_DYTSREX        __REG (MPMC_PHYS + 0x038)
#define MPMC_DYTAPR         __REG (MPMC_PHYS + 0x03C)
#define MPMC_DYTDAL         __REG (MPMC_PHYS + 0x040)
#define MPMC_DYTWR          __REG (MPMC_PHYS + 0x044)
#define MPMC_DYTRC          __REG (MPMC_PHYS + 0x048)
#define MPMC_DYTRFC         __REG (MPMC_PHYS + 0x04C)
#define MPMC_DYTXSR         __REG (MPMC_PHYS + 0x050)
#define MPMC_DYTRRD         __REG (MPMC_PHYS + 0x054)
#define MPMC_DYTMRD         __REG (MPMC_PHYS + 0x058)
#define MPMC_STEXDWT        __REG (MPMC_PHYS + 0x080)
#define MPMC_DYCONFIG       __REG (MPMC_PHYS + 0x100)
#define MPMC_DYRASCAS       __REG (MPMC_PHYS + 0x104)
#define MPMC_STCONFIG0      __REG (MPMC_PHYS + 0x200)
#define MPMC_STWTWEN0       __REG (MPMC_PHYS + 0x204)
#define MPMC_STWTOEN0       __REG (MPMC_PHYS + 0x208)
#define MPMC_STWTRD0        __REG (MPMC_PHYS + 0x20C)
#define MPMC_STWTPG0        __REG (MPMC_PHYS + 0x210)
#define MPMC_STWTWR0        __REG (MPMC_PHYS + 0x214)
#define MPMC_STWTTURN0      __REG (MPMC_PHYS + 0x218)
#define MPMC_STCONFIG1      __REG (MPMC_PHYS + 0x220)
#define MPMC_STWTWEN1       __REG (MPMC_PHYS + 0x224)
#define MPMC_STWTOEN1       __REG (MPMC_PHYS + 0x228)
#define MPMC_STWTRD1        __REG (MPMC_PHYS + 0x22C)
#define MPMC_STWTPG1        __REG (MPMC_PHYS + 0x230)
#define MPMC_STWTWR1        __REG (MPMC_PHYS + 0x234)
#define MPMC_STWTTURN1      __REG (MPMC_PHYS + 0x238)

