siredmar/master/gnublin/apex-1.6.8-vanilla-broken/src/mach-lpc313x/lpc313x.h
#define NS_TO_MPMCCLK(ns, clk)	(((ns)*((clk + 500)/1000) + 500000)/1000000)
/* MPMC Controller Bit Field constants*/
#define MPMC_CTL_LOW_PWR               _BIT(2)
#define MPMC_CTL_ENABLE                _BIT(0)
/* MPMC status Bit Field constants*/
#define MPMC_STATUS_SA                 _BIT(2)
#define MPMC_STATUS_WR_BUF             _BIT(1)
#define MPMC_STATUS_BUSY               _BIT(0)
/* MPMC config Bit Field constants*/
#define MPMC_CFG_SDCCLK_1_2            _BIT(8)
#define MPMC_CFG_SDCCLK_1_1            (0)
/* SDRAM Controller Bit Field constants*/
#define MPMC_SDRAMC_CTL_DP             _BIT(13)
#define MPMC_SDRAMC_CTL_NORMAL_CMD     _SBF(7,0)
#define MPMC_SDRAMC_CTL_MODE_CMD       _SBF(7,1)
#define MPMC_SDRAMC_CTL_PALL_CMD       _SBF(7,2)
#define MPMC_SDRAMC_CTL_NOP_CMD        _SBF(7,3)
#define MPMC_SDRAMC_CTL_MCC            _BIT(5)
#define MPMC_SDRAMC_CTL_SR             _BIT(2)
#define MPMC_SDRAMC_CTL_CS             _BIT(1)
#define MPMC_SDRAMC_CTL_CE             _BIT(0)
/* SDRAM Config Bit Field constants*/
#define MPMC_SDRAMC_CFG_SDRAM_MD       _SBF(3,0)
#define MPMC_SDRAMC_CFG_LOW_PWR_MD     _SBF(3,1)
#define MPMC_SDRAMC_CFG_SYNC_FLASH     _SBF(3,2)
#define MPMC_SDRAMC_CFG_BUF_EN         _BIT(19)
#define MPMC_SDRAMC_CFG_WP             _BIT(20)
/*16-bit external bus high-performance address mapping */
/*16Mb (2Mx8), 2 banks, row length = 11, column length = 9*/
#define SDRAMC_16HP_2Mx8_2B_R11_C9    (_SBF(7,0x00))
/*16Mb (1Mx16), 2 banks, row length = 11, column length = 8*/
#define SDRAMC_16HP_1Mx16_2B_R11_C8   (_SBF(7,0x01))
/*64Mb (8Mx8), 4 banks, row length = 12, column length = 9*/
#define SDRAMC_16HP_8Mx8_4B_R12_C9    (_SBF(7,0x04))
/*64Mb (4Mx16), 4 banks, row length = 12, column length = 8*/
#define SDRAMC_16HP_4Mx16_4B_R12_C8   (_SBF(7,0x05))
/*128Mb (16Mx8), 4 banks, row length = 12, column length = 10*/
#define SDRAMC_16HP_16Mx8_4B_R12_C10  (_SBF(7,0x08))
/*128Mb (8Mx16), 4 banks, row length = 12, column length = 9*/
#define SDRAMC_16HP_8Mx16_4B_R12_C9   (_SBF(7,0x09))
/*256Mb (32Mx8), 4 banks, row length = 13, column length = 10*/
#define SDRAMC_16HP_32Mx8_4B_R13_C10  (_SBF(7,0x0C))
/*256Mb (16Mx16), 4 banks, row length = 13, column length = 9*/
#define SDRAMC_16HP_16Mx16_4B_R13_C9  (_SBF(7,0x0D))
/*512Mb (64Mx8), 4 banks, row length = 13, column length = 11*/
#define SDRAMC_16HP_64Mx8_4B_R13_C11  (_SBF(7,0x10))
/*512Mb (32Mx16), 4 banks, row length = 13, column length = 10*/
#define SDRAMC_16HP_32Mx16_4B_R13_C10 (_SBF(7,0x11))

/*16-bit external bus low power SDRAM address mapping */
/*16Mb (2Mx8), 2 banks, row length = 11, column length = 9*/
#define SDRAMC_16LP_2Mx8_2B_R11_C9    (_SBF(7,0x20))
/*16Mb (1Mx16), 2 banks, row length = 11, column length = 8*/
#define SDRAMC_16LP_1Mx16_2B_R11_C8   (_SBF(7,0x21))
/*64Mb (8Mx8), 4 banks, row length = 12, column length = 9*/
#define SDRAMC_16LP_8Mx8_4B_R12_C9    (_SBF(7,0x24))
/*64Mb (4Mx16), 4 banks, row length = 12, column length = 8*/
#define SDRAMC_16LP_4Mx16_4B_R12_C8   (_SBF(7,0x25))
/*128Mb (16Mx8), 4 banks, row length = 12, column length = 10*/
#define SDRAMC_16LP_16Mx8_4B_R12_C10  (_SBF(7,0x28))
/*128Mb (8Mx16), 4 banks, row length = 12, column length = 9*/
#define SDRAMC_16LP_8Mx16_4B_R12_C9   (_SBF(7,0x29))
/*256Mb (32Mx8), 4 banks, row length = 13, column length = 10*/
#define SDRAMC_16LP_32Mx8_4B_R13_C10  (_SBF(7,0x2C))
/*256Mb (16Mx16), 4 banks, row length = 13, column length = 9*/
#define SDRAMC_16LP_16Mx16_4B_R13_C9  (_SBF(7,0x2D))
/*512Mb (64Mx8), 4 banks, row length = 13, column length = 11*/
#define SDRAMC_16LP_64Mx8_4B_R13_C11  (_SBF(7,0x30))
/*512Mb (32Mx16), 4 banks, row length = 13, column length = 10*/
#define SDRAMC_16LP_32Mx16_4B_R13_C10 (_SBF(7,0x31))


/* SDRAM Read Config Bit Field constants*/
#define MPMC_SDRAMC_RDCFG_CLKOUTDELAY_STG       _SBF(0,0)
#define MPMC_SDRAMC_RDCFG_CMDDELAY_STG          _SBF(0,1)
#define MPMC_SDRAMC_RDCFG_CMDDELAY_P1_STG       _SBF(0,2)
#define MPMC_SDRAMC_RDCFG_CMDDELAY_P2_STG       _SBF(0,3)
/* SDRAM RASCAS Bit Field constants*/
#define MPMC_SDRAMC_RASCAS_CAS0        _SBF(8,0)
#define MPMC_SDRAMC_RASCAS_CAS1        _SBF(8,1)
#define MPMC_SDRAMC_RASCAS_CAS2        _SBF(8,2)
#define MPMC_SDRAMC_RASCAS_CAS3        _SBF(8,3)
#define MPMC_SDRAMC_RASCAS_RAS0        _SBF(0,0)
#define MPMC_SDRAMC_RASCAS_RAS1        _SBF(0,1)
#define MPMC_SDRAMC_RASCAS_RAS2        _SBF(0,2)
#define MPMC_SDRAMC_RASCAS_RAS3        _SBF(0,3)


/***********************************************************************
* NAND Flash controller Register Structures
**********************************************************************/
#define NANDC_PHYS           (0x17000800)
#define NANDC_RAM0_PHYS	     (0x70000000)
#define NANDC_RAM1_PHYS	     (0x70000400)
#define NANDC_BUF_SZ         512
#define NANDC_IRQ_STS        __REG (NANDC_PHYS + 0x000)
#define NANDC_IRQ_MSK        __REG (NANDC_PHYS + 0x004)
#define NANDC_IRQ_STS_RAW    __REG (NANDC_PHYS + 0x008)
#define NANDC_CFG            __REG (NANDC_PHYS + 0x00C)
#define NANDC_IRQ_IO_CFG     __REG (NANDC_PHYS + 0x010)
#define NANDC_IRQ_TIMING1    __REG (NANDC_PHYS + 0x014)
#define NANDC_IRQ_TIMING2    __REG (NANDC_PHYS + 0x018)
#define NANDC_SET_CMD        __REG (NANDC_PHYS + 0x020)
#define NANDC_SET_ADDR       __REG (NANDC_PHYS + 0x024)
#define NANDC_WRITE_DATA     __REG (NANDC_PHYS + 0x028)
#define NANDC_SET_CE         __REG (NANDC_PHYS + 0x02C)
#define NANDC_READ_DATA      __REG (NANDC_PHYS + 0x030)
#define NANDC_CHECK_STS      __REG (NANDC_PHYS + 0x034)
#define NANDC_CTRL_FLOW      __REG (NANDC_PHYS + 0x038)
#define NANDC_GPIO1          __REG (NANDC_PHYS + 0x040)
#define NANDC_GPIO2          __REG (NANDC_PHYS + 0x044)
#define NANDC_IRQ_STS2       __REG (NANDC_PHYS + 0x048)
#define NANDC_IRQ_MSK2       __REG (NANDC_PHYS + 0x04C)
#define NANDC_IRQ_STS_RAW2   __REG (NANDC_PHYS + 0x050)

/* Register description of irq_status */
#define NAND_IRQ_RB3_POS_EDGE       _BIT(31)
#define NAND_IRQ_RB2_POS_EDGE       _BIT(30)
#define NAND_IRQ_RB1_POS_EDGE       _BIT(29)
#define NAND_IRQ_RB0_POS_EDGE       _BIT(28)
#define NAND_IRQ_RB_POS_EDGE(cs)    _BIT(28 + (cs))
#define NAND_IRQ_ERASED_RAM1        _BIT(27)
#define NAND_IRQ_ERASED_RAM0        _BIT(26)
#define NAND_IRQ_WR_RAM1            _BIT(25)
#define NAND_IRQ_WR_RAM0            _BIT(24)
#define NAND_IRQ_RD_RAM1            _BIT(23)
#define NAND_IRQ_RD_RAM0            _BIT(22)
#define NAND_IRQ_ECC_DEC_RAM0       _BIT(21)
#define NAND_IRQ_ECC_ENC_RAM0       _BIT(20)
#define NAND_IRQ_ECC_DEC_RAM1       _BIT(19)
#define NAND_IRQ_ECC_ENC_RAM1       _BIT(18)
#define NAND_IRQ_NOERR_RAM0         _BIT(17)
#define NAND_IRQ_ERR1_RAM0          _BIT(16)
#define NAND_IRQ_ERR2_RAM0          _BIT(15)
#define NAND_IRQ_ERR3_RAM0          _BIT(14)
#define NAND_IRQ_ERR4_RAM0          _BIT(13)
#define NAND_IRQ_ERR5_RAM0          _BIT(12)
#define NAND_IRQ_ERR_UNR_RAM0       _BIT(11)
#define NAND_IRQ_NOERR_RAM1         _BIT(10)
#define NAND_IRQ_ERR1_RAM1          _BIT(9)
#define NAND_IRQ_ERR2_RAM1          _BIT(8)
#define NAND_IRQ_ERR3_RAM1          _BIT(7)
#define NAND_IRQ_ERR4_RAM1          _BIT(6)
#define NAND_IRQ_ERR5_RAM1          _BIT(5)
#define NAND_IRQ_ERR_UNR_RAM1       _BIT(4)
#define NAND_IRQ_AES_DONE_RAM1      _BIT(1)
#define NAND_IRQ_AES_DONE_RAM0      _BIT(0)

/* Register description of config */
#define NAND_CFG_ECGC		    _BIT(13)
#define NAND_CFG_8BIT_ECC           _BIT(12)
#define NAND_CFG_TL_528             _SBF(10, 0x0)
#define NAND_CFG_TL_516             _SBF(10, 0x1)
#define NAND_CFG_TL_512             _SBF(10, 0x2)
#define NAND_CFG_TL_MASK            _SBF(10, 0x3)
#define NAND_CFG_EO                 _BIT(9)
#define NAND_CFG_DC                 _BIT(8)
#define NAND_CFG_M                  _BIT(7)
#define NAND_CFG_LC_0               _SBF(5, 0x0)
#define NAND_CFG_LC_1               _SBF(5, 0x1)
#define NAND_CFG_LC_2               _SBF(5, 0x2)
#define NAND_CFG_LC_MASK            _SBF(5, 0x3)
#define NAND_CFG_ES                 _BIT(4)
#define NAND_CFG_DE                 _BIT(3)
#define NAND_CFG_AO                 _BIT(2)
#define NAND_CFG_WD                 _BIT(1)
#define NAND_CFG_EC                 _BIT(0)

/* Register description of io_config */
#define NAND_IO_CFG_IO_DRIVE        _BIT(24)
#define NAND_IO_CFG_DATA_DEF(n)     _SBF(8, ((n) & 0xFFFF))
#define NAND_IO_CFG_CLE_1           _SBF(6, 0x01)
#define NAND_IO_CFG_ALE_1           _SBF(4, 0x01)
#define NAND_IO_CFG_WE_1            _SBF(2, 0x01)
#define NAND_IO_CFG_RE_1            _SBF(0, 0x01)

/* Register description of timing1 */
#define NAND_TIM1_TSRD(n)           _SBF(20, ((n) & 0x3))
#define NAND_TIM1_TALS(n)           _SBF(16, ((n) & 0x7))
#define NAND_TIM1_TALH(n)           _SBF(12, ((n) & 0x7))
#define NAND_TIM1_TCLS(n)           _SBF(4, ((n) & 0x7))
#define NAND_TIM1_TCLH(n)           ((n) & 0x7)

