siredmar/master/gnublin/apex-1.6.8-vanilla-broken/src/mach-lpc313x/lpc313x.h
/* Register description of timing2 */
#define NAND_TIM2_TDRD(n)           _SBF(28, ((n) & 0x7))
#define NAND_TIM2_TEBI(n)           _SBF(24, ((n) & 0x7))
#define NAND_TIM2_TCH(n)            _SBF(20, ((n) & 0x7))
#define NAND_TIM2_TCS(n)            _SBF(16, ((n) & 0x7))
#define NAND_TIM2_TRH(n)            _SBF(12, ((n) & 0x7))
#define NAND_TIM2_TRP(n)            _SBF(8, ((n) & 0x7))
#define NAND_TIM2_TWH(n)            _SBF(4, ((n) & 0x7))
#define NAND_TIM2_TWP(n)            ((n) & 0x7)

/* Register description of set_ce */
#define NAND_SETCE_OVR_EN(n)        _BIT(((n) & 0x3) + 12)
#define NAND_SETCE_OVR_V(n)         _BIT(((n) & 0x3) + 8)
#define NAND_SETCE_WP               _BIT(4)
#define NAND_SETCE_CV_MASK          0x0F
#define NAND_SETCE_CV(n)            (0x0F & ~_BIT(((n) & 0x3)))

/* Register description of check_sts */
#define NAND_CHK_STS_RB3_EDGE       _BIT(8)
#define NAND_CHK_STS_RB2_EDGE       _BIT(7)
#define NAND_CHK_STS_RB1_EDGE       _BIT(6)
#define NAND_CHK_STS_RB0_EDGE       _BIT(5)
#define NAND_CHK_STS_RB_EDGE(n)     _BIT((n) + 5)
#define NAND_CHK_STS_RB4_LVL        _BIT(4)
#define NAND_CHK_STS_RB3_LVL        _BIT(3)
#define NAND_CHK_STS_RB2_LVL        _BIT(2)
#define NAND_CHK_STS_RB1_LVL        _BIT(1)
#define NAND_CHK_STS_APB_BSY        _BIT(0)

/* Resegister description of control_flow */
#define NAND_CTRLFLW_WRITE_RAM1     _BIT(5)
#define NAND_CTRLFLW_WRITE_RAM0     _BIT(4)
#define NAND_CTRLFLW_READ_RAM1      _BIT(1)
#define NAND_CTRLFLW_READ_RAM0      _BIT(0)
/***********************************************************************
 * SD/MMC MCI register definitions
 **********************************************************************/
#define SDMMC_PHYS            (0x18000000)
#define SDMMC_CTRL            __REG (SDMMC_PHYS + 0x000)
#define SDMMC_PWREN           __REG (SDMMC_PHYS + 0x004)
#define SDMMC_CLKDIV          __REG (SDMMC_PHYS + 0x008)
#define SDMMC_CLKSRC          __REG (SDMMC_PHYS + 0x00c)
#define SDMMC_CLKENA          __REG (SDMMC_PHYS + 0x010)
#define SDMMC_TMOUT           __REG (SDMMC_PHYS + 0x014)
#define SDMMC_CTYPE           __REG (SDMMC_PHYS + 0x018)
#define SDMMC_BLKSIZ          __REG (SDMMC_PHYS + 0x01c)
#define SDMMC_BYTCNT          __REG (SDMMC_PHYS + 0x020)
#define SDMMC_INTMASK         __REG (SDMMC_PHYS + 0x024)
#define SDMMC_CMDARG          __REG (SDMMC_PHYS + 0x028)
#define SDMMC_CMD             __REG (SDMMC_PHYS + 0x02c)
#define SDMMC_RESP0           __REG (SDMMC_PHYS + 0x030)
#define SDMMC_RESP1           __REG (SDMMC_PHYS + 0x034)
#define SDMMC_RESP2           __REG (SDMMC_PHYS + 0x038)
#define SDMMC_RESP3           __REG (SDMMC_PHYS + 0x03c)
#define SDMMC_MINTSTS         __REG (SDMMC_PHYS + 0x040)
#define SDMMC_RINTSTS         __REG (SDMMC_PHYS + 0x044)
#define SDMMC_STATUS          __REG (SDMMC_PHYS + 0x048)
#define SDMMC_FIFOTH          __REG (SDMMC_PHYS + 0x04c)
#define SDMMC_TCBCNT          __REG (SDMMC_PHYS + 0x05c)
#define SDMMC_TBBCNT          __REG (SDMMC_PHYS + 0x060)
#define SDMMC_DEBNCE          __REG (SDMMC_PHYS + 0x064)
#define SDMMC_USRID           __REG (SDMMC_PHYS + 0x068)
#define SDMMC_VERID           __REG (SDMMC_PHYS + 0x06c)
#define SDMMC_HCON            __REG (SDMMC_PHYS + 0x070)
#define SDMMC_DATA            __REG (SDMMC_PHYS + 0x100)
#define SDMMC_DATA_ADR        (SDMMC_PHYS + 0x100)

/* Control register defines */
#define SDMMC_CTRL_CEATA_INT_EN   _BIT(11)
#define SDMMC_CTRL_SEND_AS_CCSD   _BIT(10)
#define SDMMC_CTRL_SEND_CCSD      _BIT(9)
#define SDMMC_CTRL_ABRT_READ_DATA _BIT(8)
#define SDMMC_CTRL_SEND_IRQ_RESP  _BIT(7)
#define SDMMC_CTRL_READ_WAIT      _BIT(6)
#define SDMMC_CTRL_DMA_ENABLE     _BIT(5)
#define SDMMC_CTRL_INT_ENABLE     _BIT(4)
#define SDMMC_CTRL_DMA_RESET      _BIT(2)
#define SDMMC_CTRL_FIFO_RESET     _BIT(1)
#define SDMMC_CTRL_RESET          _BIT(0)
/* Clock Enable register defines */
#define SDMMC_CLKEN_LOW_PWR      _BIT(16)
#define SDMMC_CLKEN_ENABLE       _BIT(0)
/* time-out register defines */
#define SDMMC_TMOUT_DATA(n)      _SBF(8, (n))
#define SDMMC_TMOUT_DATA_MSK     0xFFFFFF00
#define SDMMC_TMOUT_RESP(n)      ((n) & 0xFF)
#define SDMMC_TMOUT_RESP_MSK     0xFF
/* card-type register defines */
#define SDMMC_CTYPE_8BIT         _BIT(16)
#define SDMMC_CTYPE_4BIT         _BIT(0)
/* Interrupt status & mask register defines */
#define SDMMC_INT_SDIO           _BIT(16)
#define SDMMC_INT_EBE            _BIT(15)
#define SDMMC_INT_ACD            _BIT(14)
#define SDMMC_INT_SBE            _BIT(13)
#define SDMMC_INT_HLE            _BIT(12)
#define SDMMC_INT_FRUN           _BIT(11)
#define SDMMC_INT_HTO            _BIT(10)
#define SDMMC_INT_DTO            _BIT(9)
#define SDMMC_INT_RTO            _BIT(8)
#define SDMMC_INT_DCRC           _BIT(7)
#define SDMMC_INT_RCRC           _BIT(6)
#define SDMMC_INT_RXDR           _BIT(5)
#define SDMMC_INT_TXDR           _BIT(4)
#define SDMMC_INT_DATA_OVER      _BIT(3)
#define SDMMC_INT_CMD_DONE       _BIT(2)
#define SDMMC_INT_RESP_ERR       _BIT(1)
#define SDMMC_INT_CD             _BIT(0)
#define SDMMC_INT_ERROR          0xbfc2
/* Command register defines */
#define SDMMC_CMD_START         _BIT(31)
#define SDMMC_CMD_CCS_EXP       _BIT(23)
#define SDMMC_CMD_CEATA_RD      _BIT(22)
#define SDMMC_CMD_UPD_CLK       _BIT(21)
#define SDMMC_CMD_INIT          _BIT(15)
#define SDMMC_CMD_STOP          _BIT(14)
#define SDMMC_CMD_PRV_DAT_WAIT  _BIT(13)
#define SDMMC_CMD_SEND_STOP     _BIT(12)
#define SDMMC_CMD_STRM_MODE     _BIT(11)
#define SDMMC_CMD_DAT_WR        _BIT(10)
#define SDMMC_CMD_DAT_EXP       _BIT(9)
#define SDMMC_CMD_RESP_CRC      _BIT(8)
#define SDMMC_CMD_RESP_LONG     _BIT(7)
#define SDMMC_CMD_RESP_EXP      _BIT(6)
#define SDMMC_CMD_INDX(n)       ((n) & 0x1F)
/* Status register defines */
#define SDMMC_GET_FCNT(x)      (((x)>>17) & 0x1FF)
#define SDMMC_FIFO_SZ           128

/***********************************************************************
 * SPI register definitions
 **********************************************************************/
#define SPI_PHYS              (0x15002000)
#define SPI_CONFIG_REG        __REG (SPI_PHYS + 0x00)
#define SPI_SLV_ENAB_REG      __REG (SPI_PHYS + 0x04)
#define SPI_TXF_FLUSH_REG     __REG (SPI_PHYS + 0x08)
#define SPI_FIFO_DATA_REG     __REG (SPI_PHYS + 0x0C)
#define SPI_NHP_POP_REG       __REG (SPI_PHYS + 0x10)
#define SPI_NHP_MODE_REG      __REG (SPI_PHYS + 0x14)
#define SPI_DMA_SET_REG       __REG (SPI_PHYS + 0x18)
#define SPI_STS_REG           __REG (SPI_PHYS + 0x1C)
#define SPI_HWINFO_REG        __REG (SPI_PHYS + 0x20)
#define SPI_SLV_SET1_REG(slv) __REG (SPI_PHYS + 0x24 + (8 * slv))
#define SPI_SLV_SET2_REG(slv) __REG (SPI_PHYS + 0x28 + (8 * slv))
#define SPI_INT_TRSH_REG      __REG (SPI_PHYS + 0xFD4)
#define SPI_INT_CLRE_REG      __REG (SPI_PHYS + 0xFD8)
#define SPI_INT_SETE_REG      __REG (SPI_PHYS + 0xFDC)
#define SPI_INT_STS_REG       __REG (SPI_PHYS + 0xFE0)
#define SPI_INT_ENAB_REG      __REG (SPI_PHYS + 0xFE4)
#define SPI_INT_CLRS_REG      __REG (SPI_PHYS + 0xFE8)
#define SPI_INT_SETS_REG      __REG (SPI_PHYS + 0xFEC)
#define SPI_MOD_ID_REG        __REG (SPI_PHYS + 0xFFC)

/* SPI device contants */
#define SPI_FIFO_DEPTH  64 /* 64 words (16bit) deep */
#define SPI_NUM_SLAVES  3  /* number of slaves supported */
#define SPI_MAX_DIV2    254
#define SPI_MAX_DIVIDER 65024 /* = 254 * (255 + 1) */
#define SPI_MIN_DIVIDER 2

/* SPI Configuration register definitions (SPI_CONFIG_REG) */
#define SPI_CFG_INTER_DLY(n)      _SBF(16, ((n) & 0xFFFF))
#define SPI_CFG_INTER_DLY_GET(n)  (((n) >> 16) & 0xFFFF)
#define SPI_CFG_UPDATE_EN         _BIT(7)
#define SPI_CFG_SW_RESET          _BIT(6)
#define SPI_CFG_SLAVE_DISABLE     _BIT(4)
#define SPI_CFG_MULTI_SLAVE       _BIT(3)
#define SPI_CFG_LOOPBACK          _BIT(2)
#define SPI_CFG_SLAVE_MODE        _BIT(1)
#define SPI_CFG_ENABLE            _BIT(0)

/* SPI slave_enable register definitions (SPI_SLV_ENAB_REG) */
#define SPI_SLV_EN(n)             _SBF(((n) << 1), 0x1)
#define SPI_SLV_SUSPEND(n)        _SBF(((n) << 1), 0x3)

/* SPI tx_fifo_flush register definitions (SPI_TXF_FLUSH_REG) */
#define SPI_TXFF_FLUSH            _BIT(1)

/* SPI dma_settings register definitions (SPI_DMA_SET_REG) */
#define SPI_DMA_TX_EN             _BIT(1)
#define SPI_DMA_RX_EN             _BIT(0)

/* SPI status register definitions (SPI_STS_REG) */
#define SPI_ST_SMS_BUSY           _BIT(5)
#define SPI_ST_BUSY               _BIT(4)
#define SPI_ST_RX_FF              _BIT(3)
#define SPI_ST_RX_EMPTY           _BIT(2)
#define SPI_ST_TX_FF              _BIT(1)
#define SPI_ST_TX_EMPTY           _BIT(0)

/* SPI slv_setting registers definitions (SPI_SLV_SET1_REG) */
#define SPI_SLV1_INTER_TX_DLY(n)  _SBF(24, ((n) & 0xFF))
#define SPI_SLV1_NUM_WORDS(n)     _SBF(16, ((n) & 0xFF))
#define SPI_SLV1_CLK_PS(n)        _SBF(8, ((n) & 0xFF))
#define SPI_SLV1_CLK_PS_GET(n)    (((n) >> 8) & 0xFF)
#define SPI_SLV1_CLK_DIV1(n)      ((n) & 0xFF)
#define SPI_SLV1_CLK_DIV1_GET(n)  ((n) & 0xFF)

/* SPI slv_setting registers definitions (SPI_SLV_SET2_REG) */
#define SPI_SLV2_PPCS_DLY(n)      _SBF(9, ((n) & 0xFF))
#define SPI_SLV2_CS_HIGH          _BIT(8)
#define SPI_SLV2_SSI_MODE         _BIT(7)
#define SPI_SLV2_SPO              _BIT(6)
#define SPI_SLV2_SPH              _BIT(5)
#define SPI_SLV2_WD_SZ(n)         ((n) & 0x1F)

