siredmar/master/gnublin/apex-1.6.8-vanilla-broken/src/mach-lpc313x/lpc313x.h
/* SPI int_threshold registers definitions (SPI_INT_TRSH_REG) */
#define SPI_INT_TSHLD_TX(n)       _SBF(8, ((n) & 0xFF))
#define SPI_INT_TSHLD_RX(n)       ((n) & 0xFF)

/* SPI intterrupt registers definitions ( SPI_INT_xxx) */
#define SPI_SMS_INT               _BIT(4)
#define SPI_TX_INT                _BIT(3)
#define SPI_RX_INT                _BIT(2)
#define SPI_TO_INT                _BIT(1)
#define SPI_OVR_INT               _BIT(0)
#define SPI_ALL_INTS              (SPI_SMS_INT | SPI_TX_INT | SPI_RX_INT | SPI_TO_INT | SPI_OVR_INT)


/***********************************************************************
 * I2C register definitions
 **********************************************************************/
#define I2C0_PHYS            (0x1300A000)
#define I2C1_PHYS            (0x1300A400)
#define I2C_REG_RX(a)	      __REG ((a) + 0x000)	/* Rx FIFO reg (RO) */
#define I2C_REG_TX(a)	      __REG ((a) + 0x000)		/* Tx FIFO reg (WO) */
#define I2C_REG_STS(a)	      __REG ((a) + 0x04)	/* Status reg (RO) */
#define I2C_REG_CTL(a)	      __REG ((a) + 0x08)	/* Ctl reg */
#define I2C_REG_CKH(a)	      __REG ((a) + 0x0C)	/* Clock divider high */
#define I2C_REG_CKL(a)	      __REG ((a) + 0x10)	/* Clock divider low */
#define I2C_REG_ADR(a)	      __REG ((a) + 0x14)	/* I2C address */
#define I2C_REG_RFL(a)	      __REG ((a) + 0x18)	/* Rx FIFO level (RO) */
#define I2C_REG_TFL(a)	      __REG ((a) + 0x1c)	/* Tx FIFO level (RO) */
#define I2C_REG_RXB(a)	      __REG ((a) + 0x20)	/* Num of bytes Rx-ed (RO) */
#define I2C_REG_TXB(a)	      __REG ((a) + 0x24)	/* Num of bytes Tx-ed (RO) */
#define I2C_REG_TXS(a)	      __REG ((a) + 0x28)	/* Tx slave FIFO (RO) */
#define I2C_REG_STFL(a)	      __REG ((a) + 0x2c)	/* Tx slave FIFO level (RO) */
/* I2C Tx FIFO register definitions*/
#define I2C_TXFF_STOP_CND   _BIT(9)
#define I2C_TXFF_START_CND  _BIT(8)
#define I2C_TXFF_DATA_MSK   0xFF

/* I2C status register definitions*/
#define I2C_STS_TFES        _BIT(13)
#define I2C_STS_TFFS        _BIT(12)
#define I2C_STS_TFE         _BIT(11)
#define I2C_STS_TFF         _BIT(10)
#define I2C_STS_RFE         _BIT(9)
#define I2C_STS_RFF         _BIT(8)
#define I2C_STS_SDA         _BIT(7)
#define I2C_STS_SCL         _BIT(6)
#define I2C_STS_ACTIVE      _BIT(5)
#define I2C_STS_DRSI        _BIT(4)
#define I2C_STS_DRMI        _BIT(3)
#define I2C_STS_NAI         _BIT(2)
#define I2C_STS_AFI         _BIT(1)
#define I2C_STS_TDI         _BIT(0)

/* I2C control register definitions*/
#define I2C_CTL_TFFSIE       _BIT(10)
// #define I2C_CTL_SEVEN        _BIT(9) /* Seven-bit slave address */
#define I2C_CTL_SOFT_RESET   _BIT(8)
#define I2C_CTL_TFFIE        _BIT(7)
#define I2C_CTL_DAIE         _BIT(6)
#define I2C_CTL_RFFIE        _BIT(5)
#define I2C_CTL_DRSIE        _BIT(4)
#define I2C_CTL_DRMIE        _BIT(3)
#define I2C_CTL_NAIE         _BIT(2)
#define I2C_CTL_AFIE         _BIT(1)
#define I2C_CTL_TDIE         _BIT(0)

/***********************************************************************
* LPC315x Analog die I2C constants
**********************************************************************/
#define AD_I2C_WRITE_ADR    (_SBF(1, 0xC) | I2C_TXFF_START_CND)
#define AD_I2C_READ_ADR     (_SBF(1, 0xC) | 0x1 | I2C_TXFF_START_CND)

/* Analog die I2C Register offsets*/
#define AD_REG_OTGDCLIC_RW                            0x0000
#define AD_REG_DCDCLIC_RO                             0x0001
#define AD_REG_CGU_RW                                 0x0002
#define AD_REG_AIN_0_RW                               0x0010
#define AD_REG_AIN_1_RW                               0x0011
#define AD_REG_AOUT_RW                                0x0012
#define AD_REG_DEC_RW                                 0x0013
#define AD_REG_INT_0_RW                               0x0014
#define AD_REG_INT_1_RW                               0x0015
#define AD_REG_DAIOMUX_RW                             0x0016
#define AD_REG_AOUTDECINT_RO                          0x0017
#define AD_REG_RTC_TIME                               0x0020
#define AD_REG_RTC_ALARM_TIME                         0x0021
#define AD_REG_RTC_STATUS                             0x0022
#define AD_REG_RTC_SET_ENA_STAT                       0x0023
#define AD_REG_RTC_CLR_ENA_STAT                       0x0024
#define AD_REG_MOD_ID                                 0x03FF

/* 3v3 IO voltage rail adjustments */
#define DCDC1_3_20                   0
#define DCDC1_3_09                   1
#define DCDC1_2_97                   2
#define DCDC1_2_86                   3
#define DCDC1_2_74                   4
#define DCDC1_2_63                   5
#define DCDC1_2_51                   6
#define DCDC1_2_40                   7
/* 1v2 core voltage rail adjustments */
#define DCDC2_1_40                   0
#define DCDC2_1_33                   1
#define DCDC2_1_26                   2
#define DCDC2_1_19                   3
#define DCDC2_1_11                   4
#define DCDC2_1_04                   5
#define DCDC2_0_97                   6
#define DCDC2_0_90                   7
/* 1v4 io voltage rail adjustments */
#define PSU_VOUT3_1_40               0
#define PSU_VOUT3_1_80               _BIT(16)

/***********************************************************************
 * Memory definitions
 **********************************************************************/
#define EXT_SDRAM_PHYS		0x30000000
#define EXT_SRAM0_PHYS		0x20000000
#define EXT_SRAM1_PHYS		0x20020000
#define ISRAM0_PHYS             0x11028000
#define ISRAM0_LENGTH	        0x00018000
#define ISRAM1_PHYS             0x11040000
#define ISRAM1_LENGTH           0x00018000

/***********************************************************************
 * XTAL clock definitions
 **********************************************************************/
#define XTAL_CLOCK        CONFIG_OSC_FREQ
#define FFAST_CLOCK       XTAL_CLOCK

/* include CGU header */
#include "lpc313x_cgu.h"
#include "event_router.h"


#endif  /* __LPC313X_H__ */
